swak4Foam/Examples/groovyBC/lookupDambreak/system/funkySetFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

expressions
(
    setFromTable
    {
        field alpha.water;
        expression "pyramid(pos().x,pos().y)";
        keepPatches true;
        lookuptables2D (
            {
                name pyramid;
                outOfBounds clamp;
                fileName "$FOAM_CASE/constant/pyramid.data";
            }
        );
    }
);


// ************************************************************************* //
